t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
      <!-- ******************************  XMC4700-F100x1536  ****************************** -->
      <device Dname="XMC4700-F100x1536">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4700_series/Include/XMC4700.h"  define="XMC4700_F100x1536"/>
        <debug      svd="SVD/XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/>    
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>    
        <algorithm  name="Flash/XMC4800_1536.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_1536.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4700 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4700 Series Data Sheet"/>  
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4700 AB Errata Sheet"/>		
        <feature type="ADC"           n="24"      m="12"/>
      </device>
      </subFamily>
      
      <!-- ************************  Subfamily 'XMC4800'  **************************** -->
      <subFamily DsubFamily="XMC4800 Series">
        <feature type="DMA"           n="12"/>
        <feature type="CAN"           n="6"/>
        <feature type="ETH"           n="1" m="100000000" name="Integrated Ethernet MAC"/>
        <feature type="ComOther"      n="6"               name="Universal Serial Interface"/>
        <feature type="ComOther"      n="1"               name="EtherCAT"/>        
        <feature type="USBD"          n="1"/>          
      
      <!-- ******************************  XMC4800-E196x2048  ****************************** -->
      <device Dname="XMC4800-E196x2048">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_E196x2048"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x200000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC0"    init   ="0"   default="1"/>           
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>   
        <algorithm  name="Flash/XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>   
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="32"      m="12"/>
      </device>   

      <!-- ******************************  XMC4800-F144x2048  ****************************** -->
      <device Dname="XMC4800-F144x2048">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_F144x2048"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x200000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC0"    init   ="0"   default="1"/>           
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>    
        <algorithm  name="Flash/XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>   
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="32"      m="12"/>
      </device> 

      <!-- ******************************  XMC4800-F100x2048  ****************************** -->
      <device Dname="XMC4800-F100x2048">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_F100x2048"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x200000"   startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>    
        <algorithm  name="Flash/XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/> 
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="24"      m="12"/>
      </device> 

      <!-- ******************************  XMC4800-E196x1536  ****************************** -->
      <device Dname="XMC4800-E196x1536">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_E196x1536"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>           
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>         
        <algorithm  name="Flash/XMC4800_1536.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_1536.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>   
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="32"      m="12"/>
      </device>

      <!-- ******************************  XMC4800-F144x1536  ****************************** -->
      <device Dname="XMC4800-F144x1536">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_F144x1536"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/> 
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>         
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>        
        <algorithm  name="Flash/XMC4800_1536.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_1536.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>  
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="32"      m="12"/>
      </device>

      <!-- ******************************  XMC4800-F100x1536  ****************************** -->
      <device Dname="XMC4800-F100x1536">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_F100x1536"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/>    
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>        
        <algorithm  name="Flash/XMC4800_1536.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_1536.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>    
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="24"      m="12"/>
      </device>

      <!-- ******************************  XMC4800-E196x1024  ****************************** -->
      <device Dname="XMC4800-E196x1024">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_E196x1024"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x100000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1FFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFEE000"  size="0x12000"    init   ="0"   default="1"/>    
        <algorithm  name="Flash/XMC4800_1024.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>  
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="32"      m="12"/>
      </device>

      <!-- ******************************  XMC4800-F144x1024  ****************************** -->
      <device Dname="XMC4800-F144x1024">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4800_series/Include/XMC4800.h"  define="XMC4800_F144x1024"/>
        <debug      svd="SVD/XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x100000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1FFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFEE000"  size="0x12000"    init   ="0"   default="1"/>         
        <algorithm  name="Flash/XMC4800_1024.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/xmc4700_XMC4800_rm_v1.2_2016_04.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"     title="XMC4800 Series Data Sheet"/>    
	<book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4800 AB Errata Sheet"/>		
        <feature type="ADC"           n="32"      m="12"/>
      </device>

