t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <condition id="XMC4104_F64">                                     
      <description>Infineon XMC4104 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-F64*"/>
    </condition>

    <condition id="XMC4104_Q48">                                     
      <description>Infineon XMC4104 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-Q48*"/>
    </condition>    
 
    <condition id="XMC4108_F64">                                     
      <description>Infineon XMC4108 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-F64*"/>
    </condition>

    <condition id="XMC4108_Q48">                                     
      <description>Infineon XMC4108 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-Q48*"/>
    </condition>     
	
    <condition id="XMC4100_ARMCC">                                     
      <description>Infineon XMC4100 series</description>
	    <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4104_ARMCC"> 
      <description>Infineon XMC4104 series</description>	
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>
	
    <condition id="XMC4108_ARMCC">  
      <description>Infineon XMC4108 series</description>	
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>
	
    <condition id="XMC4100_GCC">                                     
      <description>Infineon XMC4100 series</description>
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4104_GCC"> 
      <description>Infineon XMC4104 series</description>  
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <require Tcompiler="GCC"/>
    </condition>
  
    <condition id="XMC4108_GCC">  
      <description>Infineon XMC4108 series</description>  
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4100_IAR">                                     
      <description>Infineon XMC4100 series</description>
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="XMC4104_IAR"> 
      <description>Infineon XMC4104 series</description>  
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <require Tcompiler="IAR"/>
    </condition>
  
    <condition id="XMC4108_IAR">  
      <description>Infineon XMC4108 series</description>  
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
      <require Tcompiler="IAR"/>
    </condition>
  
  
    <condition id="XMC41xx">    
      <description>Infineon XMC41xx series</description>	
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
    </condition>

    <condition id="XMC4200_F64">                                     
      <description>Infineon XMC4200 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-F64*"/>
    </condition>

    <condition id="XMC4200_Q48">                                     
      <description>Infineon XMC4200 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-Q48*"/>
    </condition>    
    
    <condition id="XMC42xx">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
    </condition>

    <condition id="XMC42xx_ARMCC">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC42xx_GCC">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC42xx_IAR">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="XMC4300_F100">                                     
      <description>Infineon XMC4300 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4300-F100*"/>
    </condition>

    <condition id="XMC43xx">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
    </condition>

    <condition id="XMC43xx_ARMCC">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
      <require Tcompiler="ARMCC"/>      
    </condition>

    <condition id="XMC43xx_GCC">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
      <require Tcompiler="GCC"/>      
    </condition>

    <condition id="XMC43xx_IAR">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
      <require Tcompiler="IAR"/>      
    </condition>

    <condition id="XMC4400_F100">                                     
      <description>Infineon XMC4400 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-F100*"/>
    </condition>

