t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <condition id="XMC4700_E196">                                     
      <description>Infineon XMC4700 series BGA196</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-E196*"/>
    </condition>
    
    <condition id="XMC4700_F144">                                     
      <description>Infineon XMC4700 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-F144*"/>
    </condition>

    <condition id="XMC4700_F100">                                     
      <description>Infineon XMC4700 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-F100*"/>
    </condition>
    
    <condition id="XMC47xx">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
    </condition>

    <condition id="XMC47xx_ARMCC">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
      <require Tcompiler="ARMCC"/>      
    </condition>

    <condition id="XMC47xx_GCC">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
      <require Tcompiler="GCC"/>     
    </condition>

    <condition id="XMC47xx_IAR">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="XMC4800_E196">                                     
      <description>Infineon XMC4800 series BGA196</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-E196*"/>
    </condition>    

    <condition id="XMC4800_F144">                                     
      <description>Infineon XMC4800 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-F144*"/>
    </condition>

    <condition id="XMC4800_F100">                                     
      <description>Infineon XMC4800 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-F100*"/>
    </condition>
    
    <condition id="XMC48xx">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
    </condition>

    <condition id="XMC48xx_ARMCC">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC48xx_GCC">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC48xx_IAR">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
      <require Tcompiler="IAR"/>
    </condition>
    
    <condition id="XMC4">                                     
      <description>Infineon XMC4000 family</description>
      <accept  condition="XMC41xx"/>
      <accept  condition="XMC42xx"/> 
      <accept  condition="XMC43xx"/> 	  
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC45xx"/>  
      <accept  condition="XMC47xx"/>      
      <accept  condition="XMC48xx"/>
    </condition>

    <condition id="XMC4 CMSIS">
      <description>Infineon XMC4000 family and CMSIS-CORE and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>	  
    </condition>

    <condition id="XMC4 CMSIS SCU">
      <description>Infineon XMC4000 family and CMSIS-CORE and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>	  
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
    </condition>
    
    <condition id="XMC4 CMSIS RTOS">
      <description>Infineon XMC4000 family, CMSIS-CORE and CMSIS-RTOS and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
    </condition>

    <condition id="XMC4 CMSIS Driver Ethernet MAC">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver Ethernet MAC</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4400_F100"/>
      <accept  condition="XMC4400_F64"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver USBD">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USBD</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <accept  condition="XMC44xx"/>
      <accept  condition="XMC42xx"/>
      <accept  condition="XMC4100_F64"/>
      <accept  condition="XMC4100_Q48"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>   
    </condition>    

