t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <condition id="XMC4 CMSIS Driver USBH">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USBH</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>   
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>   
    </condition>    
    
    <condition id="XMC4 CMSIS Driver I2C">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver I2C</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2C"/>
    </condition>    
    
    <condition id="XMC4 CMSIS Driver SPI">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver SPI</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
    </condition>    

    <condition id="CMSIS Driver SPI">
      <description>CMSIS Driver SPI</description>
      <require condition="XMC4 CMSIS"/>	  
      <require Cclass="CMSIS Driver" Cgroup="SPI"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver USART">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="UART"/>
    </condition>    

    <condition id="XMC4 HAL GPIO">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>          
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />    
    </condition>

    <condition id="XMC4 HAL VADC">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>   
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />               
      <require Cclass ="Device" Cgroup="XMClib" Csub="VADC" />    
    </condition>
    
</conditions>

  <examples>
    <!-- Infineon XMC4200 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4200 Application Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4200 Application Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4200 Application Kit/Middleware/USB/Device/VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>

    <!-- Infineon XMC4300 Relax Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4300 Relax Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4300 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example> 

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4300 Relax Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4300 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example> 
    
    <!-- Infineon XMC4400 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/Middleware/USB/Device/VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <!-- Infineon XMC4500 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

