t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <!-- Infineon XMC4700 Relax Kit -->  
    <example name="Network HTTP Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/Middleware/Network/HTTP_Server" version="1.0.0">
      <description> HTTP Server sing MDK-Professional Middleware</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>   
      </attributes>
    </example>  

    <example name="Network Telnet Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/Middleware/Network/Telnet_Server" version="1.0.0">
      <description> Telnet Server sing MDK-Professional Middleware</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>   
      </attributes>
    </example>  

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/Middleware/USB/Device/MassStorage" version="1.0.0">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>      
    
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/Middleware/USB/Device/VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

	
    <!-- Infineon XMC4800 Relax EtherCAT Kit -->  
    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="Network HTTP Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/Network/HTTP_Server" version="1.0.2">
      <description> HTTP Server sing MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>   
      </attributes>
    </example>  

    <example name="Network Telnet Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/Network/Telnet_Server" version="1.0.2">
      <description> Telnet Server sing MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>   
      </attributes>
    </example>  

    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC4800_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/USB/Device/MassStorage" version="1.0.2">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>      
    
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/USB/Device/VirtualCOM" version="1.0.2">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

    
    <!-- Infineon XMC4 Low Level Driver (LLD) Examples -->
    <!-- CAN -->    
    <example name="CAN" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CAN/CAN_LOOPBACK">
      <description>CAN example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_loopback.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU4 -->    
    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CCU4/CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/CCU4/CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU8 -->    
    <example name="CCU8" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CCU8/CCU8_TIMER">
      <description>CCU8 example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
