t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <!-- DAC -->    
    <example name="DAC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DAC/DAC_SINE">
      <description>DAC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dac_sine.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   
    <example name="DAC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/DAC/DAC_SINE">
      <description>DAC example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dac_sine.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- DMA -->    
    <example name="DMA" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DMA/DMA_M2M">
      <description>DMA example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dma_m2m.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>       
        <category>LLD Examples</category>
      </attributes>
    </example> 
     <!-- EBU -->    
    <example name="EBU" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/EBU/EBU_SDRAM"> 
      <description>XMC Lib External Bus Interface (EBU) example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ebu_sdram.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- ERU -->    
    <example name="ERU" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/ERU/ERU_EXTINT"> 
      <description>XMC Lib ERU external interrupt example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- FCE -->    
    <example name="FCE" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FCE/FCE_CRC">
      <description>FCE example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/fce_crc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FCE"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- FLASH -->    
    <example name="FLASH" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FLASH/FLASH_PROGRAM"> 
      <description>FLASH example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_program.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- GPIO -->    
    <example name="GPIO" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/GPIO/GPIO_TOGGLE"> 
      <description>XMC Lib GPIO toggle example flashes the leds of the board with a periodic rate</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                    

    <!-- HRPWM_CSG -->    
    <example name="HRPWM_CSG" doc="Readme.txt" folder="Device/XMClib/examples/XMC4400_series/HRPWM/HRPWM_CSG"> 
      <description>XMC Lib High Resolution PWM (HAPWM) driver example - CSG </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/hrpwm_csg.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- HRPWM_HRC -->    
    <example name="HRPWM_HRC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4400_series/HRPWM/HRPWM_HRC"> 
      <description>XMC Lib High Resolution PWM (HAPWM) driver example - HRC </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/hrpwm_hrc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
        
    <!-- I2C -->    
    <example name="I2C" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/I2C/I2C_TRANSFER">
      <description>I2C example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/i2c_transfer.uvprojx"/>     
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="I2C"/>   
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>              
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <!-- LEDTS -->    
    <example name="LEDTS" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/LEDTS/LEDTS_TOUCH">
      <description>LEDTS example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_touch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>         
        <category>LLD Examples</category>
      </attributes>
    </example>    
    <!-- RTC -->    
    <example name="RTC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/RTC/RTC_ALARM">
      <description>RTC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>            
    <!-- SPI -->    
    <example name="SPI" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/SPI/SPI_TRANSMIT">
      <description>SPI example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <!-- UART -->    
    <example name="UART" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/UART/UART_TRANSMIT">
      <description>UART example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
