t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <!-- VADC -->    
    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/VADC/VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/VADC/VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>  
    
    <!-- WDT -->    
    <example name="WDT" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/WDT/WDT_FEED">
      <description>WDT example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                               
    <!-- EBU -->    
    <example name="EBU" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/EBU/EBU_SDRAM">
      <description>EBU example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45B)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ebu_sdram.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>
        <category>LLD Examples</category>
      </attributes>
    </example>  
    
    <example name="emWin Example" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/emWin/Example" version="1.0.0">
      <description>emWin Graphics simple example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>
  </examples>
  
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="XMC4 CMSIS">
      <description>System Startup for Infineon XMC4000 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP
      </RTE_Components_h>
      
      <files>
        <!--  include folder -->
        <file category="include" name="Device/XMC4100_series/Include/" condition="XMC41xx"/>
        <file category="include" name="Device/XMC4200_series/Include/" condition="XMC42xx"/>
        <file category="include" name="Device/XMC4300_series/Include/" condition="XMC43xx"/>
        <file category="include" name="Device/XMC4400_series/Include/" condition="XMC44xx"/>
        <file category="include" name="Device/XMC4500_series/Include/" condition="XMC45xx"/>
        <file category="include" name="Device/XMC4700_series/Include/" condition="XMC47xx"/>        
        <file category="include" name="Device/XMC4800_series/Include/" condition="XMC48xx"/>
        
        <!--  device header file -->
        <file category="header" name="Device/XMC4100_series/Include/XMC4100.h" condition="XMC41xx" version = "1.5.1"/>
        <file category="header" name="Device/XMC4200_series/Include/XMC4200.h" condition="XMC42xx" version = "1.5.1"/>
        <file category="header" name="Device/XMC4300_series/Include/XMC4300.h" condition="XMC43xx" version = "1.0.0"/>
        <file category="header" name="Device/XMC4400_series/Include/XMC4400.h" condition="XMC44xx" version = "1.5.1"/>
        <file category="header" name="Device/XMC4500_series/Include/XMC4500.h" condition="XMC45xx" version = "1.5.1"/>
        <file category="header" name="Device/XMC4700_series/Include/XMC4700.h" condition="XMC47xx" version = "1.0.0"/>      
        <file category="header" name="Device/XMC4800_series/Include/XMC4800.h" condition="XMC48xx" version = "1.0.0"/>
        
        <!-- system file -->
        <file category="source" name="Device/XMC4100_series/Source/system_XMC4100.c" attr="config" condition="XMC41xx" version = "3.1.0"/>
        <file category="source" name="Device/XMC4200_series/Source/system_XMC4200.c" attr="config" condition="XMC42xx" version = "3.1.0"/>
        <file category="source" name="Device/XMC4300_series/Source/system_XMC4300.c" attr="config" condition="XMC43xx" version = "1.0.0"/>		
        <file category="source" name="Device/XMC4400_series/Source/system_XMC4400.c" attr="config" condition="XMC44xx" version = "3.1.0"/>
        <file category="source" name="Device/XMC4500_series/Source/system_XMC4500.c" attr="config" condition="XMC45xx" version = "3.1.0"/>
        <file category="source" name="Device/XMC4700_series/Source/system_XMC4700.c" attr="config" condition="XMC47xx" version = "1.0.0"/>      
        <file category="source" name="Device/XMC4800_series/Source/system_XMC4800.c" attr="config" condition="XMC48xx" version = "1.0.0"/>
        
        <!-- startup files -->
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4100.s" attr="config" condition="XMC4100_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4104.s" attr="config" condition="XMC4104_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4108.s" attr="config" condition="XMC4108_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4200_series/Source/ARM/startup_XMC4200.s" attr="config" condition="XMC42xx_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4300_series/Source/ARM/startup_XMC4300.s" attr="config" condition="XMC43xx_ARMCC" version = "1.0.0"/>
        <file category="source" name="Device/XMC4400_series/Source/ARM/startup_XMC4400.s" attr="config" condition="XMC4400_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4400_series/Source/ARM/startup_XMC4402.s" attr="config" condition="XMC4402_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4500.s" attr="config" condition="XMC4500_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4502.s" attr="config" condition="XMC4502_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4504.s" attr="config" condition="XMC4504_ARMCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4700_series/Source/ARM/startup_XMC4700.s" attr="config" condition="XMC47xx_ARMCC" version = "1.0.0"/>
        <file category="source" name="Device/XMC4800_series/Source/ARM/startup_XMC4800.s" attr="config" condition="XMC48xx_ARMCC" version = "1.0.0"/>

        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4100.S" attr="config" condition="XMC4100_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4104.S" attr="config" condition="XMC4104_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4108.S" attr="config" condition="XMC4108_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4200_series/Source/GCC/startup_XMC4200.S" attr="config" condition="XMC42xx_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4300_series/Source/GCC/startup_XMC4300.S" attr="config" condition="XMC43xx_GCC" version = "1.0.0"/>
        <file category="source" name="Device/XMC4400_series/Source/GCC/startup_XMC4400.S" attr="config" condition="XMC4400_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4400_series/Source/GCC/startup_XMC4402.S" attr="config" condition="XMC4402_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4500.S" attr="config" condition="XMC4500_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4502.S" attr="config" condition="XMC4502_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4504.S" attr="config" condition="XMC4504_GCC" version = "1.5.0"/>
        <file category="source" name="Device/XMC4700_series/Source/GCC/startup_XMC4700.S" attr="config" condition="XMC47xx_GCC" version = "1.0.0"/>
        <file category="source" name="Device/XMC4800_series/Source/GCC/startup_XMC4800.S" attr="config" condition="XMC48xx_GCC" version = "1.0.0"/>
        
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4100.s" attr="config" condition="XMC4100_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4104.s" attr="config" condition="XMC4104_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4108.s" attr="config" condition="XMC4108_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4200_series/Source/IAR/startup_XMC4200.s" attr="config" condition="XMC42xx_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4300_series/Source/IAR/startup_XMC4300.s" attr="config" condition="XMC43xx_IAR" version = "1.0.0"/>
        <file category="source" name="Device/XMC4400_series/Source/IAR/startup_XMC4400.s" attr="config" condition="XMC4400_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4400_series/Source/IAR/startup_XMC4402.s" attr="config" condition="XMC4402_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4500.s" attr="config" condition="XMC4500_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4502.s" attr="config" condition="XMC4502_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4504.s" attr="config" condition="XMC4504_IAR" version = "1.5.0"/>
        <file category="source" name="Device/XMC4700_series/Source/IAR/startup_XMC4700.s" attr="config" condition="XMC47xx_IAR" version = "1.0.0"/>
        <file category="source" name="Device/XMC4800_series/Source/IAR/startup_XMC4800.s" attr="config" condition="XMC48xx_IAR" version = "1.0.0"/>
        
      </files>      
    </component>
    
