t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.0.1" condition="XMC4 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver/"/>   
        <file category="header"  name="RTE_Driver/Config/XMC4100_F64/RTE_Device.h"  condition="XMC4100_F64" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4100_Q48/RTE_Device.h"  condition="XMC4100_Q48" attr="config" version="1.0.1"/>  
        <file category="header"  name="RTE_Driver/Config/XMC4100_F64/RTE_Device.h"  condition="XMC4104_F64" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4100_Q48/RTE_Device.h"  condition="XMC4104_Q48" attr="config" version="1.0.1"/>          
        <file category="header"  name="RTE_Driver/Config/XMC4100_F64/RTE_Device.h"  condition="XMC4108_F64" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4100_Q48/RTE_Device.h"  condition="XMC4108_Q48" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4200_F64/RTE_Device.h"  condition="XMC4200_F64" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4200_Q48/RTE_Device.h"  condition="XMC4200_Q48" attr="config" version="1.0.1"/> 
        <file category="header"  name="RTE_Driver/Config/XMC4300_F100/RTE_Device.h" condition="XMC4300_F100" attr="config" version="1.0.1"/> 		
        <file category="header"  name="RTE_Driver/Config/XMC4400_F64/RTE_Device.h"  condition="XMC4400_F64" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4400_F100/RTE_Device.h" condition="XMC4400_F100" attr="config" version="1.0.1"/>        
        <file category="header"  name="RTE_Driver/Config/XMC4400_F64/RTE_Device.h"  condition="XMC4402_F64" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4400_F100/RTE_Device.h" condition="XMC4402_F100" attr="config" version="1.0.1"/>      
        <file category="header"  name="RTE_Driver/Config/XMC4500_F100/RTE_Device.h" condition="XMC4500_F100" attr="config" version="1.0.1"/>
        <file category="header"  name="RTE_Driver/Config/XMC4500_F144/RTE_Device.h" condition="XMC4500_F144" attr="config" version="1.0.1"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4700_E196/RTE_Device.h" condition="XMC4700_E196" attr="config" version="1.0.1"/>
        <file category="header"  name="RTE_Driver/Config/XMC4700_F100/RTE_Device.h" condition="XMC4700_F100" attr="config" version="1.0.1"/>
        <file category="header"  name="RTE_Driver/Config/XMC4700_F144/RTE_Device.h" condition="XMC4700_F144" attr="config" version="1.0.1"/>

        <file category="header"  name="RTE_Driver/Config/XMC4800_E196/RTE_Device.h" condition="XMC4800_E196" attr="config" version="1.0.1"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F100/RTE_Device.h" condition="XMC4800_F100" attr="config" version="1.0.1"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F144/RTE_Device.h" condition="XMC4800_F144" attr="config" version="1.0.1"/>
        
      </files>
    </component>

    <!-- START: Infineon Standard Peripherals Low Level Drivers (XMClib)-->

    <component Cclass="Device" Cgroup="XMClib" Csub="VADC" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Versatile Analog-to-Digital Converter (VADC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_VADC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___v_a_d_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_vadc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="CAN" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Controller area network (CAN) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CAN
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_a_n.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_can.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="CCU4" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Capture Compare Unit 4 (CCU4) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CCU4
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_c_u4.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ccu4.c"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="XMClib" Csub="CCU8" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Capture Compare Unit 8 (CCU8) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CCU8
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_c_u8.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ccu8.c"/>
      </files>
    </component>  

    <component Cclass="Device" Cgroup="XMClib" Csub="DAC" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Digital to Analog Converter (DAC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_DAC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___d_a_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_dac.c"/>
      </files>
    </component> 
        
    <component Cclass="Device" Cgroup="XMClib" Csub="DMA" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Direct Memory Access (DMA) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_DMA
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___d_m_a.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_dma.c"/>
      </files>
    </component> 
    
    <component Cclass="Device" Cgroup="XMClib" Csub="DSD" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Delta Sigma Demodulator (DSD) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_DSD
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___d_s_d.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_dsd.c"/>
      </files>
    </component> 
   
    <component Cclass="Device" Cgroup="XMClib" Csub="EBU" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>External Bus Interface (EBU) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_EBU
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___e_b_u.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ebu.c"/>
      </files>
    </component> 

    <component Cclass="Device" Cgroup="XMClib" Csub="ERU" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Event Request Unit (ERU) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_ERU
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___e_r_u.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_eru.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_eru.c"/>
      </files>
    </component>  

    <component Cclass="Device" Cgroup="XMClib" Csub="ECAT" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description> EtherCAT (ECAT) driver for XMC4000</description>
      <RTE_Components_h>      
        #define RTE_DEVICE_XMCLIB_ECAT
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___e_c_a_t.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ecat.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="ETH_MAC" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description> Ethernet MAC (ETH_MAC) driver for XMC4000</description>
      <RTE_Components_h>      
        #define RTE_DEVICE_XMCLIB_ETH_MAC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___e_t_h___m_a_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_eth_mac.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="GPIO" Cversion="2.1.6" condition="XMC4 CMSIS">
      <description>General Purpose Input/Output (GPIO) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_GPIO
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___g_p_i_o.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_gpio.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_gpio.c"/>
      </files>
    </component> 
            
    <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>High Resolution PWM (HAPWM) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_HRPWM
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___h_r_p_w_m.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_hrpwm.c"/>
      </files>
    </component> 

    <component Cclass="Device" Cgroup="XMClib" Csub="I2C" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Inter Integrated Circuit (also known as I2C) (I2C) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_I2C
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___i2_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_usic.c"/>
        <file category="source" name="Device/XMClib/src/xmc_i2c.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="I2S" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Inter-IC Sound Interface (also known as I2S) (I2S) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_I2S
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___i2_s.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_usic.c"/>
        <file category="source" name="Device/XMClib/src/xmc_i2s.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>LED and Touch Sense (Control Unit) (LEDTS) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_LEDTS
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___l_e_d_t_s.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ledts.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="POSIF" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Position Interface (POSIF) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_POSIF
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___p_o_s_i_f.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_posif.c"/>
      </files>
    </component>
        
    <component Cclass="Device" Cgroup="XMClib" Csub="RTC" Cversion="2.1.6" condition="XMC4 CMSIS SCU">
      <description>Real Time Clock (RTC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_RTC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___r_t_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_rtc.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_rtc.c"/>
      </files>
    </component>
    
     <component Cclass="Device" Cgroup="XMClib" Csub="SCU" Cversion="2.1.6" condition="XMC4 CMSIS">
      <description>System Control Unit (SCU) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_SCU
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___s_c_u.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_scu.c"/>
      </files>
    </component>

