t21/Walnut_X/Packages/.cache/Infineon.XMC4000_DFP.2.5.0.pdsc
    <!-- Board Support Pack (BSP) for XMC4500 Application Kit -->   
    <bundle Cbundle="XMC4500 Application Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC4500 Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4500_General_Purpose_(CPU_45A-V3)_R1.0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/LED_CPU45ApplicationKit.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/Buttons_CPU45ApplicationKit.c"/>
        </files>
      </component>    
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="CMSIS Driver SPI">
        <description>emWin LCD SPI Interface for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/LCD_X.c"/>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/LCDConf.c"/>
        </files>
      </component>       
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4500 Relax Kit -->   
    <bundle Cbundle="XMC4500 Relax Lite Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC4500 Relax Lite Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC4500_Relax_Kit-V1_R1.2.pdf</doc>    
      <component Cgroup="A/D Converter" condition="XMC4 HAL VADC">
        <description>A/D Converter interface for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Lite Kit/Common/ADC_XMC4500.c"/>
        </files>
      </component>       
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Lite Kit/Common/LED_XMC4500.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Lite Kit/Common/Buttons_XMC4500.c"/>
        </files>
      </component>     
    </bundle>
    

    
  </components>
</package>
